app/controllers/blogs_controller.rb

  def list
    @latest_blogs = Blog.order("created_at DESC")
---
SELECT "blogs".* FROM "blogs" ORDER BY created_at DESC

  def submit_blog
    blog = Blog.create title:params[:title], body:params[:body]
---
INSERT INTO "blogs" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "test"], ["created_at", Sat, 16 Feb 2013 09:15:54 UTC +00:00], ["title", "test"], ["updated_at", Sat, 16 Feb 2013 09:15:54 UTC +00:00]]

  def view
    @current_path = request.fullpath
    @current_blog = Blog.find params[:blog_id]
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", "1"]]